scripts/mutants/P1-redact-renders-payload.patch
diff --git a/src/privacy.ts b/src/privacy.ts
index b7bd18a..2fd2e26 100644
--- a/src/privacy.ts
+++ b/src/privacy.ts
@@ -346,7 +346,7 @@ function resolveValue(raw: unknown, settings: PrivacySettings): Resolution {
 
   if (settings.redactAll) return PRIVATE_PLACEHOLDER;
   if (visibility === 'public') return payload;
-  return privateRevealAllowed() ? payload : PRIVATE_PLACEHOLDER;
+  return payload;
 }
 
 /**
