scripts/mutants/F1-entry-limit-exclusive.patch
diff --git a/src/destinations/FileDestination.ts b/src/destinations/FileDestination.ts
--- a/src/destinations/FileDestination.ts
+++ b/src/destinations/FileDestination.ts
@@ -759,7 +759,7 @@
     // counters and the notice have to carry — not the size of whatever
     // undersized floor the formatter came back with instead.
     const bytes = utf8Length(record);
-    if (bytes <= this.maxEntryBytes) {
+    if (bytes < this.maxEntryBytes) {
       this.batcher.add(record, bytes);
       return;
     }
